### Dependencies

In [52]:
import pandas as pd
import os.path
from sqlalchemy import create_engine

from config import user, password, db_name

### Extract CSVs into DataFrames & Transform - Mass Shooting Data

In [53]:
# Read and combine mass shooting data files into dataframe
mass_shooting_df = pd.concat(
    map(pd.read_csv, ["Resources/Mass_shootings_2019.csv", "Resources/Mass_shootings_2018.csv","Resources/Mass_shootings_2017.csv"]), ignore_index=True, sort=False)

# Remove unrequired columns
mass_shooting_df = mass_shooting_df[["Incident Date","State","City Or County","# Killed","# Injured"]].copy()

# Rename columns
mass_shooting_df.columns = ["incident_date","us_state","city","number_killed","number_injured"]

# Convert Incident Date to date time format
mass_shooting_df["incident_date"] = pd.to_datetime(mass_shooting_df["incident_date"])

mass_shooting_df.head()

  incident_date    us_state      city  number_killed  number_injured
0    2019-12-29    Illinois  Danville              0               5
1    2019-12-29    New York   Buffalo              1               3
2    2019-12-29  California     Ceres              0               5
3    2019-12-27  California   Modesto              1               3
4    2019-12-27       Texas   Houston              2               7

### Extract CSVs into DataFrames & Transform - Population Data

In [54]:
# Read CSV file
csv_file = "Resources/Population_data_2019.csv"
pop_2019_df = pd.read_csv(csv_file, header=None);

# Remove first 2 rows and make 3rd row header
pop_2019_df = pop_2019_df.iloc[2:,:]
new_header = pop_2019_df.iloc[0]
pop_2019_df = pop_2019_df[1:]
pop_2019_df.columns= new_header

# Remove totals row
pop_2019_df = pop_2019_df.iloc[1:,:]

# New column for year of data
filedate=2019
pop_2019_df[8]=filedate

# Rename and sort columns
pop_2019_df.columns =["Location","0-18","19-25","26-34","35-54","55-64","65+","Total","Year"]
pop_2019_df= pop_2019_df[["Year","Location","0-18","19-25","26-34","35-54","55-64","65+","Total"]]

pop_2019_df.head()

,Year,Location,0-18,19-25,26-34,35-54,55-64,65+,Total
4,2019,Alabama,1128100,414500,549500,1195300,645000,834700,4767100
5,2019,Alaska,181700,65300,97500,172900,92800,91500,701700
6,2019,Arizona,1701600,656800,860500,1708100,877500,1293600,7098000
7,2019,Arkansas,720800,253500,335600,723700,383200,505700,2922500
8,2019,California,9171300,3539800,5288800,10152200,4751600,5739000,38642700

In [55]:
# Read CSV file
csv_file = "Resources/Population_data_2018.csv"
pop_2018_df = pd.read_csv(csv_file, header=None);

# Remove first 2 rows and make 3rd row header
pop_2018_df = pop_2018_df.iloc[2:,:]
new_header = pop_2018_df.iloc[0]
pop_2018_df = pop_2018_df[1:]
pop_2018_df.columns= new_header

# Remove totals row
pop_2018_df = pop_2018_df.iloc[1:,:]

# New column for year of data
filedate=2018
pop_2018_df[8]=filedate

# Rename and sort columns
pop_2018_df.columns =["Location","0-18","19-25","26-34","35-54","55-64","65+","Total","Year"]
pop_2018_df= pop_2018_df[["Year","Location","0-18","19-25","26-34","35-54","55-64","65+","Total"]]

pop_2018_df.head()

,Year,Location,0-18,19-25,26-34,35-54,55-64,65+,Total
4,2018,Alabama,1128300,419500,554400,1192600,646800,811000,4752600
5,2018,Alaska,191100,62200,93400,182800,94100,85500,709100
6,2018,Arizona,1706300,645900,841100,1702900,862200,1245900,7004300
7,2018,Arkansas,728600,255200,345400,722800,380200,489100,2921300
8,2018,California,9324800,3594300,5299700,10212700,4737800,5576600,38745900

In [56]:
# Read CSV file
csv_file = "Resources/Population_data_2017.csv"
pop_2017_df = pd.read_csv(csv_file, header=None);

# Remove first 2 rows and make 3rd row header
pop_2017_df = pop_2017_df.iloc[2:,:]
new_header = pop_2017_df.iloc[0]
pop_2017_df = pop_2017_df[1:]
pop_2017_df.columns= new_header

# Remove totals row
pop_2017_df = pop_2017_df.iloc[1:,:]

# New column for year of data
filedate=2017
pop_2017_df[8]=filedate

# Rename and sort columns
pop_2017_df.columns =["Location","0-18","19-25","26-34","35-54","55-64","65+","Total","Year"]
pop_2017_df= pop_2017_df[["Year","Location","0-18","19-25","26-34","35-54","55-64","65+","Total"]]

pop_2017_df.head()

,Year,Location,0-18,19-25,26-34,35-54,55-64,65+,Total
4,2017,Alabama,1138300,430500,536200,1207200,645600,783600,4741400
5,2017,Alaska,192300,63500,97900,183600,92400,80500,710100
6,2017,Arizona,1686200,637200,815200,1677000,839900,1185700,6841300
7,2017,Arkansas,730600,265200,329800,726600,377100,480600,2910000
8,2017,California,9363800,3697900,5240600,10277900,4720500,5413200,38713900

In [57]:
# Merge and append yearly CSV files
pop_age_df = pd.concat([pop_2019_df, pop_2018_df, pop_2017_df], ignore_index=True, sort=False)

# Format data type to number
pop_age_df["0-18"] =pd.to_numeric(pop_age_df["0-18"])
pop_age_df["19-25"] =pd.to_numeric(pop_age_df["19-25"])
pop_age_df["26-34"] =pd.to_numeric(pop_age_df["26-34"])
pop_age_df["35-54"] =pd.to_numeric(pop_age_df["35-54"])
pop_age_df["55-64"] =pd.to_numeric(pop_age_df["55-64"])
pop_age_df["65+"] =pd.to_numeric(pop_age_df["65+"])
pop_age_df["Total"] =pd.to_numeric(pop_age_df["Total"])

pop_age_df.head()

,Year,Location,0-18,19-25,26-34,35-54,55-64,65+,Total
0,2019,Alabama,1128100,414500,549500.0,1195300,645000.0,834700,4767100
1,2019,Alaska,181700,65300,97500.0,172900,92800.0,91500,701700
2,2019,Arizona,1701600,656800,860500.0,1708100,877500.0,1293600,7098000
3,2019,Arkansas,720800,253500,335600.0,723700,383200.0,505700,2922500
4,2019,California,9171300,3539800,5288800.0,10152200,4751600.0,5739000,38642700

### Extract CSVs into DataFrames & Transform - Insurance Status Data

In [59]:
# Read CSV file
csv_file = "Resources/Population_ins_status_2019.csv"
insurance_2019_df = pd.read_csv(csv_file, header=None);

# Remove first 2 rows and make 3rd row header
insurance_2019_df = insurance_2019_df.iloc[2:,:]
new_header = insurance_2019_df.iloc[0]
insurance_2019_df = insurance_2019_df[1:]
insurance_2019_df.columns= new_header

# Remove totals row
insurance_2019_df = insurance_2019_df.iloc[1:,:]

# New column for year of data
filedate=2019
insurance_2019_df[8]=filedate

# Rename and sort columns
insurance_2019_df.columns =["Location","Employer","Non_group","Medicaid","Medicare","Military","Uninsured","Total","Year"]
insurance_2019_df= insurance_2019_df[["Year","Location","Employer","Non_group","Medicaid","Medicare","Military","Uninsured","Total"]]

insurance_2019_df.head()

,Year,Location,Employer,Non_group,Medicaid,Medicare,Military,Uninsured,Total
4,2019,Alabama,2250900,263400,929500,763800,99000,460400,4767100
5,2019,Alaska,339800,24700,149400,70200,37100,80500,701700
6,2019,Arizona,3202000,366500,1489600,1145300,105600,789100,7098000
7,2019,Arkansas,1226300,157300,767000,464200,41800,265800,2922500
8,2019,California,18538700,2569600,9790000,4388900,350200,3005400,38642700

In [60]:
# Read CSV file
csv_file = "Resources/Population_ins_status_2018.csv"
insurance_2018_df = pd.read_csv(csv_file, header=None);

# Remove first 2 rows and make 3rd row header
insurance_2018_df = insurance_2018_df.iloc[2:,:]
new_header = insurance_2018_df.iloc[0]
insurance_2018_df = insurance_2018_df[1:]
insurance_2018_df.columns= new_header

# Remove totals row
insurance_2018_df = insurance_2018_df.iloc[1:,:]

# New column for year of data
filedate=2018
insurance_2018_df[8]=filedate

# Rename and sort columns
insurance_2018_df.columns =["Location","Employer","Non_group","Medicaid","Medicare","Military","Uninsured","Total","Year"]
insurance_2018_df= insurance_2018_df[["Year","Location","Employer","Non_group","Medicaid","Medicare","Military","Uninsured","Total"]]

insurance_2018_df.head()

,Year,Location,Employer,Non_group,Medicaid,Medicare,Military,Uninsured,Total
4,2018,Alabama,2232000,257400,928300,754900,96600,483400,4752600
5,2018,Alaska,341300,26000,151200,66900,38500,85400,709100
6,2018,Arizona,3114300,381600,1568300,1092100,104500,743500,7004300
7,2018,Arkansas,1223300,162400,796600,455900,41200,242000,2921300
8,2018,California,18346700,2802100,10194300,4240200,388400,2774100,38745900

In [61]:
# Read CSV file
csv_file = "Resources/Population_ins_status_2017.csv"
insurance_2017_df = pd.read_csv(csv_file, header=None);

# Remove first 2 rows and make 3rd row header
insurance_2017_df = insurance_2017_df.iloc[2:,:]
new_header = insurance_2017_df.iloc[0]
insurance_2017_df = insurance_2017_df[1:]
insurance_2017_df.columns= new_header

# Remove totals row
insurance_2017_df = insurance_2017_df.iloc[1:,:]

# New column for year of data
filedate=2017
insurance_2017_df[8]=filedate

# Rename and sort columns
insurance_2017_df.columns =["Location","Employer","Non_group","Medicaid","Medicare","Military","Uninsured","Total","Year"]
insurance_2017_df= insurance_2017_df[["Year","Location","Employer","Non_group","Medicaid","Medicare","Military","Uninsured","Total"]]

insurance_2017_df.head()

,Year,Location,Employer,Non_group,Medicaid,Medicare,Military,Uninsured,Total
4,2017,Alabama,2179900,292200,977900,745800,93100,452600,4741400
5,2017,Alaska,320700,22900,156400,63100,48200,98700,710100
6,2017,Arizona,3075100,396400,1526400,1046800,110100,686400,6841300
7,2017,Arkansas,1208600,183200,784600,450700,49700,233100,2910000
8,2017,California,18253400,2876500,10238500,4181900,363900,2799600,38713900

In [70]:
# Merge and append yearly CSV files
insurance_status_df = pd.concat([insurance_2019_df, insurance_2018_df, insurance_2017_df], ignore_index=True, sort=False)

# Format data type to number
insurance_status_df["Employer"] =pd.to_numeric(insurance_status_df["Employer"])
insurance_status_df["Non_group"] =pd.to_numeric(insurance_status_df["Non_group"])
insurance_status_df["Medicaid"] =pd.to_numeric(insurance_status_df["Medicaid"])
insurance_status_df["Medicare"] =pd.to_numeric(insurance_status_df["Medicare"])
insurance_status_df["Military"] =pd.to_numeric(insurance_status_df["Military"])
insurance_status_df["Uninsured"] =pd.to_numeric(insurance_status_df["Uninsured"])
insurance_status_df["Total"] =pd.to_numeric(insurance_status_df["Total"])

insurance_status_df.head()

,Year,Location,Employer,Non_group,Medicaid,Medicare,Military,Uninsured,Total
0,2019,Alabama,2250900,263400,929500,763800,99000,460400,4767100
1,2019,Alaska,339800,24700,149400,70200,37100,80500,701700
2,2019,Arizona,3202000,366500,1489600,1145300,105600,789100,7098000
3,2019,Arkansas,1226300,157300,767000,464200,41800,265800,2922500
4,2019,California,18538700,2569600,9790000,4388900,350200,3005400,38642700

### Connect to local database

In [72]:
# rds_connection_string = "{user}:{password}@localhost:5432/{db_name}"
# engine = create_engine(f'postgresql://{user}:{password}@localhost:5432/{db_name}')
engine = create_engine(f"postgresql://{user}:{password}@localhost:5432/{db_name}")
connection = engine.connect()

### Check for tables

In [73]:
engine.table_names()

C:\Users\Home\AppData\Local\Temp/ipykernel_11248/4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['shooting_event', 'location_population', 'insurance_status']

### Load DataFrames into database

In [74]:
# Load Mass shooting data to db
mass_shooting_df.to_sql(name='shooting_event', con=engine, if_exists='append', index=False)

In [86]:
# Confirm upload to db
pd.read_sql_query('select * from shooting_event', con=engine).head()

         incident_date    us_state      city  number_killed  number_injured
0  2019-12-29 00:00:00    Illinois  Danville              0               5
1  2019-12-29 00:00:00    New York   Buffalo              1               3
2  2019-12-29 00:00:00  California     Ceres              0               5
3  2019-12-27 00:00:00  California   Modesto              1               3
4  2019-12-27 00:00:00       Texas   Houston              2               7

In [76]:
# Load population data to db
pop_age_df.to_sql(name='location_population', con=engine, if_exists='append', index=False)

In [84]:
pd.read_sql_query('select * from location_population', con=engine).head()

,Year,Location,0-18,19-25,26-34,35-54,55-64,65+,Total
0,2019,Alabama,1128100,414500,549500,1195300,645000,834700,4767100
1,2019,Alaska,181700,65300,97500,172900,92800,91500,701700
2,2019,Arizona,1701600,656800,860500,1708100,877500,1293600,7098000
3,2019,Arkansas,720800,253500,335600,723700,383200,505700,2922500
4,2019,California,9171300,3539800,5288800,10152200,4751600,5739000,38642700

In [79]:
# Load insurance data to db
insurance_status_df.to_sql(name='insurance_status', con=engine, if_exists='append', index=False)

In [82]:
# Confirm upload to db
pd.read_sql_query('select * from insurance_status', con=engine).head()

,Year,Location,Employer,Non_group,Medicaid,Medicare,Military,Uninsured,Total
0,2019,Alabama,2250900,263400,929500,763800,99000,460400,4767100
1,2019,Alaska,339800,24700,149400,70200,37100,80500,701700
2,2019,Arizona,3202000,366500,1489600,1145300,105600,789100,7098000
3,2019,Arkansas,1226300,157300,767000,464200,41800,265800,2922500
4,2019,California,18538700,2569600,9790000,4388900,350200,3005400,38642700